import fs from 'fs';

let handler = async (m, { conn }) => {
  let txt = `
   *ʜᴏʟᴀ 👋🏻 ᴇꜱᴛᴇ ᴇꜱ ᴍɪ ᴍᴇɴᴜ*

  🌙 *\`ɪɴꜰᴏʀᴍᴀᴄɪÓɴ\`*
  
  .⁎✿ *.ᴘᴇʀꜰɪʟ* ✿⁎.
  .⁎✿ *.ᴍᴇɴᴜ* ✿⁎.
  .⁎✿ *.ɢʀᴜᴘᴏꜱ* ✿⁎.
  
  🌙 *\`ɪᴀ\`*
  
  .⁎✿ *.ʀᴇᴍɪɴɪ* ✿⁎.
  .⁎✿ *.ʜᴅ* ✿⁎.
  .⁎✿ *.ᴇɴʜᴀɴᴄᴇ* ✿⁎.
  .⁎✿ *.ᴡᴀʟʟᴘᴀᴘᴇʀ <Qᴜᴇʀʏ>* ✿ ⁎.
  .⁎✿ *.ɢᴇᴍɪɴɪ / ɪᴀ* ✿⁎.
  .⁎✿ *.ᴘɪxᴀɪ <Qᴜᴇʀʏ>* ✿⁎.
  
  🌙 *\`ʙᴜꜱQᴜᴇᴅᴀꜱ\`*.

  .⁎✿ *.ɢᴏᴏɢʟᴇ <Qᴜᴇʀʏ>* ✿⁎.
  .⁎✿ *.ᴛɪᴋᴛᴏᴋꜱᴇᴀʀᴄʜ <Qᴜᴇʀʏ>* ✿⁎.
  .⁎✿ *.ʏᴛꜱᴇᴀʀᴄʜ <Qᴜᴇʀʏ>* ✿⁎.
  .⁎✿ *.ɪᴍᴀɢᴇɴ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ᴘʟᴀʏ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ʏᴛᴅʟᴍᴘ3 <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ʏᴛᴅʟᴍᴘ4 <ᴛxᴛ>* ✿⁎.
  
  🌙 *\`ᴊᴜᴇɢᴏꜱ\`*

  .⁎✿ *.ᴀʙʀᴀᴢᴀʀ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴀᴄᴇʀᴛɪᴊᴏ* ✿⁎.
  .⁎✿ *.ꜱᴏɴʀᴏᴊᴀʀꜱᴇ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴄᴏɴꜱᴇᴊᴏ* ✿⁎.
  .⁎✿ *.ᴇɴᴀᴍᴏʀᴀᴅᴀ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴍᴇᴍᴇ* ✿⁎.
  .⁎✿ *.ᴀᴄᴀʀɪᴄɪᴀʀ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴘᴇʀꜱᴏɴᴀʟɪᴅᴀᴅ* ✿⁎.
  .⁎✿ *.ᴘɪʀᴏᴘᴏ* ✿⁎.
  .⁎✿ *ᴘᴏQᴜᴇᴅᴇx <ᴘᴏᴋᴇᴍÓɴ>* ✿⁎.
  .⁎✿ *.ᴘʀᴇɢᴜɴᴛᴀ* ✿⁎.
  .⁎✿ *.ᴅᴏʀᴍɪʀ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴛʀɪꜱᴛᴇ <@ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴛᴏᴘ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ᴢᴏᴅɪᴀᴄ <2020 02 12> ✿⁎.

  🌙 *\`ᴊᴀᴅɪʙᴏᴛ\`*

  .⁎✿ *.ᴄᴏᴅᴇ* ✿⁎.
  .⁎✿ *.ꜱᴇʀʙᴏᴛ* ✿⁎.

  🌙 *\`ꜱᴛɪᴄᴋᴇʀꜱ\`*

  .⁎✿ *.Qᴄ* ✿⁎.
  .⁎✿ *.ꜱᴛɪᴋᴇʀ <ɪᴍɢ>* ✿⁎.
  .⁎✿ *.ꜱᴛɪᴄᴋᴇʀ <ᴜʀʟ>* ✿⁎.
  .⁎✿ *.ᴛᴀᴋᴇ <ɴᴏᴍʙʀᴇ/ᴀᴜᴛᴏʀ>* ✿⁎.

  🌙 *\`ɴꜱꜰᴡ\`*

  .⁎✿ *.xɴxxꜱᴇᴀʀᴄʜ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.xɴxxᴅʟ <ʟɪɴᴋ>* ✿⁎.

  🌙 *\`ᴀɴɪᴍᴇꜱ\`*

  .⁎✿ *.ʀᴜʟᴇ34 <ᴛᴀɢ>* ✿⁎.
  .⁎✿ *.ᴡᴀɪꜰᴜ* ✿⁎.
  .⁎✿ *.ʜᴇɴᴛᴀɪꜱᴇᴀʀᴄʜ <Qᴜᴇʀʏ>* ✿⁎.
  .⁎✿ *.ʜᴇɴᴛᴀɪᴅʟ <ʟɪɴᴋ / ɪᴅ>* ✿⁎.

  🌙 *\`ɢʀᴜᴘᴏꜱ\`*

  .⁎✿ *.ʟɪɴᴋ* ✿⁎.
  .⁎✿ *.ɢʀᴜᴘᴏ ᴏᴘᴇɴ / ᴄʟᴏꜱᴇ* ✿⁎.
  .⁎✿ *.ᴅᴇʟᴇᴛᴇ* ✿⁎.
  .⁎✿ *.ᴅᴇᴍᴏᴛᴇ* ✿⁎.
  .⁎✿ *.ᴘʀᴏᴍᴏᴛᴇ* ✿⁎.
  .⁎✿ *.ʜɪᴅᴇᴛᴀɢ* ✿⁎.
  .⁎✿ *.ɪɴꜰᴏɢʀᴜᴘᴏ* ✿⁎.
  .⁎✿ *.ᴋɪᴄᴋ* ✿⁎.
  .⁎✿ *.ʟɪꜱᴛᴀᴅᴠ* ✿⁎.
  .⁎✿ *.ᴛᴀɢᴀʟʟ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ɪɴᴠᴏᴄᴀʀ <ᴛxᴛ>* ✿⁎.

  🌙 *\`ᴏɴ / ᴏꜰꜰ\`*

  .⁎✿ *.ᴇɴᴀʙʟᴇ* ✿⁎.
  .⁎✿ *.ᴅɪꜱᴀʙʟᴇ* ✿⁎.

  🌙 *\`ᴅᴇꜱᴄᴀʀɢᴀꜱ\`*

  .⁎✿ *.ꜰᴀᴄᴇʙᴏᴏᴋ - ꜰʙ* ✿⁎.
  .⁎✿ *.ɪᴍᴀɢᴇɴ <ᴛxᴛ>* ✿⁎.
  .⁎✿ *.ɪɴꜱᴛᴀɢʀᴀᴍ - ɪɢ* ✿⁎.
  .⁎✿ *.ᴛɪᴋᴛᴏᴋ* ✿⁎.
  .⁎✿ *.ʏᴛᴍᴘ4* ✿⁎.
  .⁎✿ *.ʏᴛᴍᴘ3* ✿⁎.

  🌙 *\`ʜᴇʀʀᴀᴍɪᴇɴᴛᴀꜱ\`*

  .⁎✿ *.ᴛᴏᴀɴɪᴍᴇ* ✿⁎.
  .⁎✿ *.ʀᴇᴍɪɴɪ* ✿⁎.
  .⁎✿ *.ʜᴅ* ✿⁎.
  .⁎✿ *.ᴇɴʜᴀɴᴄᴇ* ✿⁎.
  .⁎✿ *.ꜱꜱᴡᴇʙ* ✿⁎.
  .⁎✿ *.ꜱꜱ* ✿⁎.
  .⁎✿ *.ᴛʀᴀᴅ* ✿⁎.

  🌙 *\`ᴀᴜᴅɪᴏꜱ\`*

  .⁎✿ *.ʙᴀꜱꜱ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ʙʟᴏᴡɴ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ᴅᴇᴇᴘ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ᴇᴀʀʀᴀᴘᴇ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ꜰᴀꜱᴛ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ꜰᴀᴛ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ɴɪɢʜᴛᴄᴏʀᴇ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ʀᴇᴠᴇʀꜱᴇ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ʀᴏʙᴏᴛ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ꜱʟᴏᴡ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ꜱᴍᴏᴏᴛʜ <ᴠɴ>* ✿⁎.
  .⁎✿ *.ᴛᴜᴘᴀɪ <ᴠɴ>* ✿⁎.

  🌙 *\`ᴄᴏɴᴠᴇʀᴛɪᴅᴏʀᴇꜱ\`*

  .⁎✿ *.ᴛᴏɢɪꜰᴀᴜᴅ* ✿⁎.
  .⁎✿ *.ᴛᴏɪᴍɢ* ✿⁎.
  .⁎✿ *.ᴛᴏᴀᴜᴅɪᴏ* ✿⁎.

  🌙 *\`ᴀᴅᴍɪɴ\`*

  .⁎✿ *.ᴀᴅᴅᴘʀᴇᴍ2 <@ᴛᴀɢ> <ᴅᴀʏꜱ>* ✿⁎.
  .⁎✿ *.ᴀᴅᴅʏᴇɴ2 <@ᴛᴀɢ>* ✿⁎.`.trim();

  let db = JSON.parse(fs.readFileSync('src/database/db.json', 'utf-8'));
  let videoUrl = db.links.video[0];

  await conn.sendMessage(m.chat, {
    video: { url: videoUrl },
    caption: txt,
    gifPlayback: true
  }, { quoted: m });

  m.react('✅');
};

handler.help = ['menu'];
handler.tags = ['main'];
handler.command = ['main', 'menu', 'menuall', 'menucompleto'];
handler.register = true

export default handler;
